{
  "answer back": [
    "odpowiadać niegrzecznie, pyskować",
    "How dare you answer back like that?!"
  ],
  "answer for sb/sth": [
    "odpowiadać za coś, ponosić odpowiedzialność",
    "\"You can't make me answer for his mistakes. That's unfair!\""
  ],
  "answer for": [
    "ręczyć za",
    "I can answer for her qualifications in the field."
  ],
  "ask after sb": [
    "pytać o kogoś, dopytywać sie",
    "He seems to be really interested - he keeps asking after you."
  ],
  "ask out": [
    "zaprosić kogoś (do kina, restauracji)",
    "You behave like a moron! Ask her out and then you will know if she likes you or not!"
  ],
  "back sb/sth up": [
    "popierać, potwierdzać",
    "Will you back me up if I present the alternative solution to the problem?"
  ],
  "back out": [
    "wycofywać się",
    "Make them sign the agreement so that they would not back out from the project."
  ],
  "call off": [
    "odwołać (np. spotkanie)",
    "They had to call the meeting off because their partners asked for more time to decide on conditions."
  ],
  "break down": [
    "zepsuć się",
    "They got caught quite easily as their runaway car broke down after few miles."
  ],
  "be after": [
    "poszukiwać, gonić, ścigać",
    "John is after a job in marketing."
  ],
  "break up (with sb)": [
    "zerwać z kimś",
    "\"I didn't know Leven has broken up with Joe!\""
  ],
  "burst out": [
    "wybuchać",
    "He burst out laughing when he heard this joke for the first time."
  ],
  "care for": [
    "opiekować się, troszczyć",
    "She cares for her younger sister."
  ],
  "carry out": [
    "wypełniać, wykonać, zrealizować",
    "I hope she will carry out her research as it may be a real breakthrough."
  ],
  "check in": [
    "zgłosić się do odprawy",
    "All the passengers should check in one hour before the departure."
  ],
  "check off": [
    "zaznaczać (np. na liście)",
    "\"Please check off all the names on the list to make sure everyone's present.\""
  ],
  "check out": [
    "sprawdzać",
    "Can somebody check out who is at the door?"
  ],
  "check up on sth/sb": [
    "sprawdzać, kontrolować",
    "I hate when he checks up on me to be sure that I go where I tell him."
  ],
  "clean up": [
    "posprzątać",
    "Clean up your room before you leave."
  ],
  "clear sth out": [
    "posprzątać dokładnie",
    "\"Next weekend I'm gonna finally clear my wardrobe out.\""
  ],
  "clear up": [
    "przejaśniać się (o pogodzie), przechodzić (o chorobie)",
    "\"The weather's clearing up.\""
  ],
  "clear sth up": [
    "wyjaśniać, rozwiązywać (zagadkę, problem)",
    "Yes, we had an arguement but we cleared it up already."
  ],
  "cloud over": [
    "zachmurzyć się",
    "As the sky clouded over, we had to resign from sunbathing that day."
  ],
  "come about": [
    "zdarzać się",
    "He said he had no idea how all these things may have come about in his company."
  ],
  "come across": [
    "sprawiać wrażenie",
    "John came across as being an extremely shy person."
  ],
  "come across sth/sb": [
    "natknąć się (na coś/kogoś)",
    "I came across this precious painting while I was tidying my basement."
  ],
  "come apart": [
    "rozpadać się",
    "We need a new bed, the old one is coming apart."
  ],
  "come back": [
    "wracać",
    "\"Don't wait for me, I don't know when I'll be coming back.\""
  ],
  "come out": [
    "pojawiać się, ukazywać się",
    "The first issue of this newspaper came out in 1956."
  ],
  "depend on": [
    "polegać na",
    "\"You can always depend on me.    The tram is late again! You really can't depend on public transport.\""
  ],
  "depend on sth": [
    "zależeć (od czegoś)",
    "Our decision depends on the results of the test."
  ],
  "die away": [
    "zanikać, cichnąć",
    "Her voice gradually died away and there was silence again."
  ],
  "die out": [
    "wymierać, zanikać",
    "Dinosaurs died out 65 million years ago."
  ],
  "do away with sth": [
    "pozbywać się",
    "\"Why don't they do away with all these stupid rules!\""
  ],
  "do without": [
    "radzić sobie bez czegoś",
    "\"I'm afraid she'll have to do without my help.\""
  ],
  "drop by/in": [
    "wpaść (z wizytą)",
    "\"Do not hesitate to drop in whenever you're in the neighbourhood.\""
  ],
  "drop out": [
    "rezygnować",
    "Sue decided to drop out of school."
  ],
  "eat out": [
    "zjeść na mieście",
    "\"Do you feel like eating out today's evening?\""
  ],
  "enter into": [
    "zagłębiać się",
    "\"He doesn't want to enter into details at the moment.\""
  ],
  "fall apart": [
    "rozpadać się",
    "Her relationship fell apart after two years.    When Mark left Eve, her whole world fell apart."
  ],
  "fall for sb/sth": [
    "zakochać się",
    "I fell for her the moment I saw her for the first time."
  ],
  "fight back": [
    "oddawać (w walce, bójce)",
    "\"Don't stand like this! Fight back!\""
  ],
  "fill in sth": [
    "wypełniać",
    "Please fill in the application form."
  ],
  "fill (sth) up": [
    "wypełnić, zapełnić",
    "The room was filled up with people."
  ],
  "find out": [
    "dowiedzieć się",
    "Did you find out how much he had paid?"
  ],
  "fool around/about": [
    "wygłupiać się",
    "\"Stop fooling around with the knife or you'll get hurt.\""
  ],
  "get away": [
    "uciec",
    "I thought I would never get away from that boring guy!"
  ],
  "get away with sth": [
    "uchodzić na sucho",
    "We all knew he was lying but he managed to get away with it."
  ],
  "get back": [
    "wracać",
    "When did you get back?"
  ],
  "get sth back": [
    "dostać coś z powrotem",
    "\"Can I borrow this book? You'll get it back next week.\""
  ],
  "get sb down": [
    "zasmucać, przygnębiać",
    "\"I hate autumn. It's always getting me down.\""
  ],
  "get sth down": [
    "zapisywać",
    "Did you get her telephone number down?"
  ],
  "get in": [
    "przychodzić, przyjeżdżać",
    "What time did you get in last night?"
  ],
  "get in (into)": [
    "wsiadać, wchodzić",
    "\"How did all of you manage to get into such a small car?    The doors were closed and I couldn't get in.\""
  ],
  "get off (sth)": [
    "wysiadać, wychodzić",
    "To get to the museum you have to get off at fifth stop.    What time do you usually get off work?"
  ],
  "get on/along": [
    "radzić sobie",
    "How is she getting on in the marketing course?"
  ],
  "get on": [
    "wsiadać do/na",
    "\"The bus was full so we couldn't get on.\""
  ],
  "get on/along (with sb)": [
    "mieć przyjazne stosunki z kimś",
    "I and Susan get on with each other."
  ],
  "get out": [
    "wysiadać",
    "I got out of the car and went home."
  ],
  "go out": [
    "wychodzić, spotykać się z ludźmi",
    "\"Mark doesn't go out much.\""
  ],
  "get out of sth": [
    "wykręcać się",
    "\"I don't feel like going to her parents but I can't get out of it now.\""
  ],
  "get over": [
    "dochodzić do siebie, pogodzić się z czymś",
    "\"It took him over two years to get over his wife's death.\""
  ],
  "get round/around": [
    "ominąć problem, znaleźć rozwiązanie",
    "We still have to get around the lack of resources."
  ],
  "get (sb) through (sth)": [
    "poradzić sobie z czymś, przejść przez coś, pomagać komuś przejść przez coś",
    "He got through the exams and got into college."
  ],
  "get through": [
    "dodzwonić się",
    "\"I tried to contact her but I couldn't get through.\""
  ],
  "get together (with sb)": [
    "spotykać się",
    "\"Let's get together and talk about it.\""
  ],
  "get up": [
    "wstawać",
    "Everyone got up as the president arrived."
  ],
  "give sb away": [
    "prowadzić pannę młodą do ołtarza",
    "\"The bride's father usually gives her away.\""
  ],
  "give sth away": [
    "rozdawać, oddawać",
    "Mary gave her old clothes away to poor people."
  ],
  "give sb/sth away": [
    "zdradzać",
    "\"He's so self-controlled that he never gives his true feelings away.\""
  ],
  "give back": [
    "oddawać",
    "Please give me back my CDs."
  ],
  "give in to sb/sth": [
    "poddawać się komuś, czemuś",
    "She gave in to despair and refused to take medicine."
  ],
  "give sth out": [
    "rozdawać",
    "Could you give out the leaflets to everyone?"
  ],
  "give up": [
    "poddawać się",
    "\"Don't give up. There's still a chance.\""
  ],
  "give up sth": [
    "przestać coś robić",
    "I gave up smoking two months ago."
  ],
  "go ahead": [
    "rozpoczynać",
    "\"We can't go ahead with the project without him.\""
  ],
  "go away": [
    "wyjeżdżać, iść (sobie)",
    "Leave me alone! Go away!"
  ],
  "go back": [
    "wracać",
    "When are you going back to Madrit?"
  ],
  "go by": [
    "upływać (czas)",
    "As time went by, her fear grew more and more."
  ],
  "go down": [
    "spadać",
    "Now, as the prices went down, I can afford this car."
  ],
  "go off": [
    "wybuchać",
    "Two people died when a bomb went off in a shop."
  ],
  "go on": [
    "kontynuować, trwać",
    "Sorry for the interruption, please go on."
  ],
  "go through sth": [
    "przechodzić przez coś, cierpieć",
    "During her marriage she went through hell with her husband."
  ],
  "go together": [
    "pasować do siebie",
    "In my opinion the dark shirt and this tie go together perfectly."
  ],
  "go under": [
    "zatonąć",
    "After being hit with a torpedo the ship went under in few minutes."
  ],
  "go up": [
    "rosnąć",
    "The price of bread has gone up again."
  ],
  "go with sth": [
    "pasować",
    "White wine best goes with fish."
  ],
  "go without": [
    "obywać się bez czegoś",
    "\"You'll have to go without bonus this month.\""
  ],
  "grow up": [
    "dorastać",
    "\"Don't behave like a child! Grow up!\""
  ],
  "hand sth in": [
    "oddawać, wręczać",
    "Please finish writing and hand in the essays."
  ],
  "hand out": [
    "wydawać, wręczać",
    "My job is to stand on the pavement and hand out leaflets to people."
  ],
  "hang on": [
    "czekać przez chwilę",
    "\"Hang on a second, I'll be right there.\""
  ],
  "hang up": [
    "odkładać słuchawkę",
    "She was so annoying that I just hung up."
  ],
  "head for": [
    "iść/jechać w określonym kierunku, zmierzać do",
    "The troops were heading for the capital city."
  ],
  "hear from": [
    "otrzymywać od kogoś wiadomość",
    "\"I haven't heard from him for ages.\""
  ],
  "hit back": [
    "odgryźć się",
    "\"You have to hit back after what he's told you.\""
  ],
  "hold back": [
    "powstrzymywać, zatrzymywać",
    "Bodyguards had to hold back the crowd as Madonna stepped out of the car."
  ],
  "hold on": [
    "czekać chwilę",
    "\"Hold on a second, I'm almost ready.\""
  ],
  "hurry up": [
    "pośpieszyć się",
    "Hurry up! We have to be there at 5."
  ],
  "join in": [
    "przyłączać się",
    "\"We're going for a picnic tomorrow. Why don't you join in?\""
  ],
  "keep away": [
    "trzymać się z daleka od czegoś",
    "\"Keep away from him or you'll get into trouble.\""
  ],
  "keep on": [
    "kontynuować, robić coś dalej, bez przerwy",
    "\"Why you always keep on asking me about Mark? I don't want to talk about him!\""
  ],
  "keep up (with)": [
    "nadążać, być na bieżąco",
    "\"I can't keep up with computers, it's all changing too fast for me.\""
  ],
  "kick off": [
    "rozpoczynać mecz (piłki nożnej)",
    "What time do they kick off?"
  ],
  "know of": [
    "wiedzieć o czymś, znać",
    "Do you know of any Italian restaurants in Paris?"
  ],
  "laugh at": [
    "śmiać się z czegoś",
    "What are you laughing at?"
  ],
  "leave out": [
    "opuszczać, pomijać",
    "\"Prepare the list carefully, I don't want anyone to be left out.\""
  ],
  "let down": [
    "zawodzić",
    "\"You let me down again, I can't trust you any more.\""
  ],
  "let out": [
    "wypuszczać, pozwolić iść",
    "\"The classes finished earlier but we were not let out before 3 o'clock.\""
  ],
  "log in/on": [
    "zalogować się, włączyć do sieci",
    "\"I can't log in, I forgot the password.\""
  ],
  "log out/off": [
    "wylogować się, wyłączyć się z sieci",
    "Please log out and turn the computer off."
  ],
  "look after": [
    "opiekować się, pilnować",
    "\"We need to find someone to look after the kids when we're out tomorrow evening.\""
  ],
  "look around": [
    "rozglądać się",
    "Look around and check if you find something interesting for you."
  ],
  "look at": [
    "przyglądać się, patrzeć",
    "What are you looking at?"
  ],
  "look back": [
    "spoglądać w przeszłość",
    "\"When I look back, I must admit that I don't regret anything in my life.\""
  ],
  "look forward to": [
    "cieszyć sie na coś, bardzo czekać na",
    "\"I'm looking forward to hearing from you soon.\""
  ],
  "look into": [
    "badać, przyglądać się",
    "The police are looking into the cause of the accident."
  ],
  "look out": [
    "uważać",
    "Look out!"
  ],
  "look out for": [
    "uważać na",
    "Look out for your bag or someone will steal it."
  ],
  "look through": [
    "przeglądać",
    "She looked through the fashion magazines but found nothing interesting."
  ],
  "look up": [
    "sprawdzać",
    "Could someone look up this word in a dictionary?"
  ],
  "make for": [
    "poruszać się w kierunku czegoś",
    "He tried to make for the exit but was too drunk to reach it."
  ],
  "be made for": [
    "być stworzonym dla kogoś/siebie",
    "Mary and Paul seem to be made for each other."
  ],
  "make of": [
    "myśleć o, sądzić o",
    "\"What do you make of Peter? I think he's very intelligent.\""
  ],
  "make up": [
    "robić makijaż",
    "I always make up before I leave house."
  ],
  "make it up to sb": [
    "wynagradzać",
    "\"They helped me so much... I don't know how I am going to make it up to them.\""
  ],
  "mess about/around": [
    "nie robić nic specjalnego, kręcić się bez celu",
    "Will you stop messing around and start working?"
  ],
  "move in": [
    "wprowadzać się",
    "\"I didn't like this flat when I moved in but now I think it's quite cosy.\""
  ],
  "move out": [
    "wyprowadzać się",
    "We have to move out till the end of the month."
  ],
  "pass away": [
    "umierać, odchodzić",
    "The old lady passed away yesterday at ten."
  ],
  "pass by": [
    "przechodzić, przejeżdżać obok",
    "\"Every day I pass by this shop when I'm on my way to work.\""
  ],
  "pass out": [
    "zemdleć",
    "\"It was so stuffy in the room that I wasn't surprised at all that some people passed out.\""
  ],
  "pick up": [
    "podnosić",
    "\"Sue picked up the phone and dialled her boyfriend's number.\""
  ],
  "plug in": [
    "podłączyć (np. do kontaktu)",
    "\"I haven't plugged in the TV yet, I just bought it.\""
  ],
  "print out": [
    "wydrukować",
    "Could you please print out this document for me?"
  ],
  "pull down": [
    "zburzyć",
    "They had to pull down the old building to built a new shopping centre there."
  ],
  "pull in": [
    "wjeżdżać na stację",
    "The train from Manchester is pulling in on platform 1."
  ],
  "pull out": [
    "wyjeżdżać ze stacji",
    "A train has just pulled out of the station."
  ],
  "pull up": [
    "zatrzymać się, zaparkować",
    "A blue car has just pulled up near the cinema."
  ],
  "put back": [
    "odłożyć na miejsce",
    "\"Remember to put back the CDs when you don't listen to them.\""
  ],
  "put forward": [
    "przesunąć wskazówkę do przodu, zmienić czas na późniejszy",
    "We put the clocks forward in spring."
  ],
  "put down": [
    "kłaść",
    "\"Put down your bags and let's go to the kitchen.\""
  ],
  "put off": [
    "odkładać, przełożyć na inny termin",
    "Can you put off the meeting? I need to talk to you."
  ],
  "put on": [
    "zakładać (na siebie)",
    "\"It's quite cold so you'd better put on your coat.\""
  ],
  "put out": [
    "gasić (światło, ogień, etc.)",
    "\"Put out the lights, I'm tired and want to go sleep.    Put the cigarette out, it's non-smoking area.\""
  ],
  "put up with": [
    "znosić",
    "\"How do you put up with him? He's so irritating.\""
  ],
  "read out": [
    "czytać na głos",
    "Now I will read out the names of our competition winners."
  ],
  "relate to": [
    "odnosić się, być powiązanym",
    "\"This book relates to the case of JFK's assasination.\""
  ],
  "ring back": [
    "zadzwonić ponownie",
    "\"She can't talk at the moment, can you ring back later?\""
  ],
  "ring up": [
    "dzwonić, telefonować",
    "Ring me up in the evening."
  ],
  "round up": [
    "zaokrąglić w górę",
    "Round it up to 50 zlotys, please."
  ],
  "round down": [
    "zaokrąglać w dół",
    "They rounded it down to $3000."
  ],
  "rule out": [
    "wykluczyć",
    "The police had ruled him out as a suspect."
  ],
  "run across": [
    "spotkać, wpaść na kogoś przypadkiem",
    "She run across her old love when she was buying present for her husband."
  ],
  "run away": [
    "uciekać",
    "\"Run away or they'll beat you up.\""
  ],
  "run into": [
    "spotkać kogoś przypadkiem",
    "\"You won't believe whom I ran into this morning!\""
  ],
  "run out": [
    "kończyć się, brakować",
    "\"We've run out of the paper for printing.    Time's running out, we've got only 2 minutes left.    I ran out of butter in the morning so I had to go shopping.\""
  ],
  "run up": [
    "podbiec",
    "I ran up to him and gave him a hug."
  ],
  "screw up": [
    "zepsuć, zniszczyć",
    "\"You'd better not screw it up this time.\""
  ],
  "see off": [
    "odprowadzać kogoś",
    "All my friends came to see me off at the airport."
  ],
  "see through": [
    "przejrzeć (podstęp)",
    "\"I didn't see her through and now I'm toasted.\""
  ],
  "sell out": [
    "wyprzedawać",
    "A bookstore sold out his new book in just few hours."
  ],
  "send in": [
    "wysyłać, nadsyłać",
    "Please send in application forms before the end of the month."
  ],
  "set off": [
    "wyruszyć, rozpocząć podróż",
    "We set off early in the morning."
  ],
  "set out": [
    "wyruszać, rozpoczynać podróż",
    "We are planning to set out at about 8."
  ],
  "settle down": [
    "osiedlić się, zamieszkać na stałe",
    "He thinks it is high time to settle down and start a decent life."
  ],
  "shoot down": [
    "zastrzelić, zestrzelić",
    "Three enemy planes have been shot down during the battle."
  ],
  "sign in": [
    "zapisać się, wpisać na listę",
    "First of all you have to sign in at reception."
  ],
  "sign out": [
    "wypisać się",
    "\"Don't forget to sign out before you leave.\""
  ],
  "sign up": [
    "zapisać się",
    "John has signed up for almost all classes. When will he find time for that?"
  ],
  "show up": [
    "pojawiać się",
    "\"We'd been waiting for him 2 hours and he didn't show up.\""
  ],
  "slow down": [
    "zwalniać",
    "\"You're driving too fast, please slow down.\""
  ],
  "speak for": [
    "mówić za kogoś",
    "Speak for yourself. I hate this place."
  ],
  "speed up": [
    "przyspieszać",
    "\"Speed up, we can't drive so slow on a highway.\""
  ],
  "split up": [
    "rozejść się",
    "\"I'm not with Susan any more, we split up two weeks ago.\""
  ],
  "stand back": [
    "odsunąć się",
    "The police told everyone to stand back."
  ],
  "stand by": [
    "być w gotowości",
    "The antiterrorist squads are standing by behind this building."
  ],
  "stand for": [
    "oznaczać, znaczyć",
    "Do you know what CNN stands for?"
  ],
  "start over": [
    "zaczynać coś od nowa",
    "I made so many mistakes that I better start everything over again."
  ],
  "stay away": [
    "trzymać sie z dala",
    "\"You'd better stay away from my brother.\""
  ],
  "stay in": [
    "zostać w domu",
    "\"I don't feel like going out today, I'll stay in.\""
  ],
  "stay out": [
    "być poza domem do późna",
    "\"I don't mind if he stays out but yesterday he went too far.\""
  ],
  "stay out of": [
    "trzymać się z dala",
    "\"Stay out of any troubles or you'll get back to jail.\""
  ],
  "stay up": [
    "nie kłaść się, iść do łóżka później",
    "Tom stayed up till 3 in the night to watch the final NBA play."
  ],
  "strike back": [
    "bronić się, zaatakować kogoś",
    "If we attack them, they will strike back for sure."
  ],
  "sum up": [
    "podsumować",
    "To sum up our discussion - we need to hire two more people."
  ],
  "switch on": [
    "włączać",
    "\"Switch on the TV, there's weather forecast in few minutes.\""
  ],
  "switch off": [
    "wyłączyć",
    "Switch off the radio before you leave."
  ],
  "take aback": [
    "zaskoczyć",
    "I was taken aback when I heard Sue married Tom."
  ],
  "take after": [
    "być podobnym (do kogoś w rodzinie)",
    "\"Peter takes after his father, he's very tall.\""
  ],
  "take away": [
    "zabierać, odbierać",
    "Mary took away a knife from her child."
  ],
  "take back": [
    "oddawać, zwracać",
    "Adam took his new trousers back as he discovered a flaw on them."
  ],
  "take off": [
    "wystartować",
    "When I was young I loved watching planes take off."
  ],
  "take out": [
    "usuwać",
    "He had his tooth taken out."
  ],
  "take on": [
    "zatrudniać",
    "Our company wants to take on two new programmers."
  ],
  "take over": [
    "przejmować (obowiązki)",
    "\"I wonder who will take over from me when I'm on long holiday.\""
  ],
  "take up": [
    "brać/zabierać się za coś",
    "\"Sue's taken up basketball recently.\""
  ],
  "throw away": [
    "wyrzucać",
    "When will you finally throw away this old coat?"
  ],
  "track down": [
    "wyśledzić, wytropić",
    "They managed to track down that stolen jewellry from the Royal Collection."
  ],
  "try on": [
    "przymierzać",
    "Try on the red blouse, I think it suits better."
  ],
  "try out": [
    "wypróbować",
    "\"We're trying out a new computer system in our company.\""
  ],
  "turn back": [
    "zawracać",
    "After two days we had no money and had to turn back."
  ],
  "turn down": [
    "odrzucić (propozycję)",
    "Mark asked Susan to marry him but she turned him down."
  ],
  "turn off": [
    "wyłączać",
    "\"Turn off the radio please, I'd like to read.\""
  ],
  "turn on": [
    "włączać",
    "Turn on the TV, the game starts in few minutes."
  ],
  "turn out": [
    "okazać się",
    "\"It turned out that we've bought the same skirt.\""
  ],
  "turn to": [
    "zwracać się (z prośbą)",
    "He turned to the judge to postpone the date of the trial."
  ],
  "turn up": [
    "pojawić się, znaleźć się",
    "He disappeared as quick as he had turned up."
  ],
  "identify with": [
    "utożsamiać się",
    "Many girls try to identify with their idols."
  ],
  "wash up": [
    "zmywać",
    "I hate washing up."
  ],
  "watch out": [
    "uważać",
    "Watch out! You are not allowed to walk here without proper equipment!"
  ],
  "immerse in": [
    "pochłaniać, zagłębiać się",
    "After having her first baby, she was totally immersed in family life."
  ],
  "impose sth on/upon": [
    "narzucać coś",
    "Spanish invaders imposed their culture and beliefs on native Americans."
  ],
  "write down": [
    "zapisywać",
    "Would you like to write down my address?"
  ],
  "indulge in": [
    "folgować sobie/ pozwalać sobie na coś",
    "I indulged in a cup of hot chocolate in the morning."
  ],
  "inform on sb": [
    "informować/donosić",
    "\"The police have somebody here to inform on the terrorists' movements.\""
  ],
  "infringe on/upon": [
    "naruszać/łamać",
    "\"This new law will infringe on freedom of speech, I'm afraid.\""
  ],
  "inquire into": [
    "wypytywać o coś/badać/dochodzić",
    "The judge wants the deputy to inquire into the case in greater detail."
  ],
  "insist on/upon": [
    "domagać się/upierać się",
    "\"Lucy insisted on seeing her lawyer before giving any answers to officer's questions.\""
  ],
  "interfere with": [
    "majstrować przy czymś/zakłócać",
    "\"I don't want my kids to interfere with any electrical stuff that we have at home.\""
  ],
  "itch for": [
    "palić się do zrobienia czegoś/nie móc się doczekać",
    "I was itching for the lesson to end, as we were supposed to have a match right after it."
  ],
  "yank out": [
    "wyszarpnąć/ wyciągnąć",
    "He fought for a while with the cord but finally yanked out the plug from the socket."
  ],
  "nail down": [
    "zmusić kogoś, przycisnąć",
    "She told us just the news - we will need to nail her down to reveal more details."
  ],
  "name after": [
    "nazwać po kimś",
    "Jacky was named after her grandmother."
  ],
  "narrow down": [
    "zawęzić",
    "We wanted to narrow down the list of candidates for the elections."
  ],
  "nod off": [
    "przysnąć, zdrzemnąć się",
    "He usually nods off in front of the TV."
  ],
  "nose about/around": [
    "szukać/węszyć",
    "Call the security! Somebody was nosing around in my office."
  ],
  "note down": [
    "notować/zapisywać",
    "Please note down the following emergency numbers."
  ],
  "object to": [
    "sprzeciwiać się, oponować",
    "The President objected to the idea of further cuts in defence spending."
  ],
  "adhere to": [
    "trzymać się (np. zasad)",
    "If you refuse to adhere to the rules of the club, you may be expelled."
  ],
  "aim at": [
    "dążyć do czegoś/być skierowanym na coś",
    "Most of his books are aimed at teenager readers."
  ],
  "associate with": [
    "łączyć /wiązać coś z czymś",
    "\"It's ridiculous to associate happiness with full bank account...\""
  ],
  "bank on": [
    "liczyć na coś",
    "\"Tom is very disappointed as he banked on the pay rise and finally he didn't get it.\""
  ],
  "beat sb up": [
    "pobić kogoś/ poturbować",
    "He was dragged out of the car and beaten up by the street gang."
  ],
  "bend down": [
    "pochylić się",
    "Johnny! Bend down and do your shoelaces."
  ],
  "blend in/into": [
    "wtapiać się",
    "Chameleons can blend in with their surroundings."
  ],
  "boss about/ round": [
    "rządzić/ dyrygować kimś",
    "I hate when somebody wants to boss me around!"
  ],
  "break away": [
    "wyłamać się",
    "He wanted to break away from the traditional image of an artist and always wore suits in his studio."
  ],
  "break out": [
    "uciec z więzienia",
    "He broke out of the state prison last night."
  ],
  "break through": [
    "przełamać coś/ przedrzeć się",
    "\"The soldiers are reported to successfully break through the enemy's trenches.\""
  ],
  "breeze into (the building, etc)": [
    "wchodzić gdzieś pewnie",
    "She usually breezes into the meeting and shares her opinions with everybody present."
  ],
  "breeze through": [
    "przejść przez coś z łatwością",
    "He breezed through the university entrance exams."
  ],
  "brighten up": [
    "rozjaśnić, upiększyć",
    "She put some flowers to the vase to brighten the room up."
  ],
  "bring about": [
    "spowodować",
    "Now we can just wait what these changes will bring about."
  ],
  "bring sb around/round": [
    "ocucić",
    "We tried to bring her round but in vain."
  ],
  "bring back": [
    "przywrócić",
    "The photos we watched together brought back a lot of memories."
  ],
  "bring down": [
    "obalić",
    "The present acute crisis in economy may bring the government down."
  ],
  "bring together": [
    "pogodzić/ polepszyć stosunki",
    "The disaster brought the local community together."
  ],
  "bring up": [
    "wychować",
    "She was brought up to respect other people."
  ],
  "brush aside": [
    "zignorować, odrzucić",
    "\"He brushed aside his advisor's ideas and consequently lost the campaign.\""
  ],
  "brush up": [
    "podszlifować, odświeżyć (umiejętności)",
    "He went to France to brush up on his French before the exam."
  ],
  "bump into": [
    "\"spotkać, 'wpaść' na kogoś\"",
    "I bumped into my Mum when I tried to leave the house unnoticed."
  ],
  "bundle up": [
    "opatulić",
    "She bundled the kittens up in blankets before taking them to the vet."
  ],
  "burst in": [
    "wtargnąć",
    "The crowd burst in the palace and started the plunder."
  ],
  "butt in": [
    "wtrącać się, mieszać do czegoś",
    "She got mad as he butted in once again with his stupid remarks."
  ],
  "button up": [
    "zapiąć guziki",
    "\"Button up Billy, will you? It's quite cold today.\""
  ],
  "call in": [
    "wpaść do kogoś",
    "Call in for a cup of coffee when you are in town."
  ],
  "calm down": [
    "uspokoić się",
    "They had a hard time in their relationship but now everything seems to have calmed down."
  ],
  "carry on": [
    "kontynuować",
    "The light went out but the surgeon insisted on carrying on with the operation."
  ],
  "catch up": [
    "dogonić, dorównać",
    "You will have to work harder in order to catch up with the rest of the team."
  ],
  "cheat on": [
    "zdradzać (żonę/męża)",
    "She had a nervous breakdown when she discovered that her husband has been cheating on her."
  ],
  "cheer up": [
    "rozchmurzyć się, poweseleć",
    "She went to the hairdresser to cheer herself up after the test."
  ],
  "chew sth over": [
    "\"rozgryźć coś, 'przeżuć'\"",
    "OK. There is no need to hurry - you can just chew it over and give the answer next week."
  ],
  "chill out": [
    "\"'wyluzować'\"",
    "Oh, come on! Get a drink and chill out!"
  ],
  "chip in": [
    "zrzucić się",
    "\"We all chipped in for our parents' present.\""
  ],
  "come down": [
    "spaść",
    "This shelf is overloaded! It may come down any minute!"
  ],
  "come around/round": [
    "odzyskać przytomność",
    "As she was the only witness of the accident, the police officer waited till she came round to ask her some questions."
  ],
  "come down on": [
    "\"ostro coś krytykować/ 'zjechać'\"",
    "The press came down on his new play."
  ],
  "come down with": [
    "zachorować",
    "He came down with flu and had to stay in bed."
  ],
  "wind down": [
    "rozluźnić się, zrelaksować",
    "I like to wind down watching movies with my friends."
  ],
  "come out with": [
    "wyskakiwać z czymś",
    "She came out with her accusations quite unexpectedly."
  ],
  "count on": [
    "liczyć na kogoś",
    "You can always count on Jim in situation like this."
  ],
  "cross out": [
    "skreślić, wykreślić",
    "Your essay is too long - cross some sentences out."
  ],
  "cuddle up": [
    "przytulić się",
    "I often cuddle up to my pony when I feel unhappy."
  ],
  "cut down on": [
    "ograniczyć coś",
    "I try to cut down on sweets and coffee."
  ],
  "cut down": [
    "ograniczyć, skrócić",
    "I think you should cut down hours you spend in front of computer screen."
  ],
  "cut in": [
    "zajechać drogę",
    "He cursed and slammed on the brakes as the car suddenly cut in in front of him."
  ],
  "cut off": [
    "odciąć",
    "Electricity has been cut off for the whole week."
  ],
  "deal with": [
    "zajmować się, radzić sobie z czymś",
    "Do you think you can deal with this sort of problem?"
  ],
  "decide on": [
    "zdecydować się na coś",
    "We have decided on holiday in Spain."
  ],
  "delve into": [
    "zagłębiać się",
    "\"I don't want to delve into details concerning his death. It's too painful.\""
  ],
  "deprive of": [
    "pozbawić czegoś",
    "Living in the country will deprive you of all the nightlife you like so much."
  ],
  "devote to": [
    "poświęcać się",
    "She devoted all her life to fighting for human rights."
  ],
  "dig out": [
    "\"'dokopać się' do informacji\"",
    "I spent hours in the library but finally I dug out everything I needed."
  ],
  "do up": [
    "zapiąć, zasunąć",
    "Could you help me do up my dress?"
  ],
  "drag away": [
    "odwlec, odciągnąć",
    "Drag him away from the TV somehow! He needs more exercise."
  ],
  "drop off": [
    "podrzucić kogoś gdzieś po drodze",
    "\"I'm going to the city centre now, so if you want I can drop you off to the library.\""
  ],
  "dwell on": [
    "rozpamiętywać coś",
    "Jimmy! Stop moaning and dwelling on your past mistakes! The show must go on!"
  ],
  "fade away": [
    "zanikać",
    "The ink writing has faded away and now it is barely visible."
  ],
  "fall behind": [
    "zostawać z tyłu",
    "The horse started the race quite promising but then fell behind on the last bend.  Tom has fallen behind in his English recently."
  ],
  "fall out": [
    "pokłócić się (i zerwać znajomość)",
    "\"I haven't seen him since we fell out last week. And I don't think I want to...\""
  ],
  "feel for": [
    "współczuć",
    "We felt for her when her husband disappeared and left her with all his debts."
  ],
  "focus on/upon": [
    "koncentrować się",
    "His research focuses on developing new information technologies."
  ],
  "fold up": [
    "składać",
    "You can fold the map up - I know where we are."
  ],
  "frolic about/around": [
    "wygłupiać się, bawić",
    "He loves frolicking around with his dog."
  ],
  "hang out": [
    "spędzać czas",
    "In summer a lot of young people hang out here."
  ],
  "have on": [
    "mieć przy sobie",
    "Do you have any money on you?"
  ],
  "heat up": [
    "podgrzać",
    "His rude answer heated up the discussion."
  ],
  "hold up": [
    "opóźniać",
    "The flight to London was held up due to bad weather conditions."
  ],
  "hook up": [
    "podłączyć",
    "Have you hooked up to the Internet yet?"
  ],
  "hush up": [
    "wyciszyć (sprawę, aferę)",
    "The government will do anything to hush it up as one of the ministers was involved in the case."
  ],
  "jot down": [
    "zapisać coś szybko",
    "She called the helpline and jotted down a few telephone numbers."
  ],
  "kick back": [
    "relaksować się",
    "Tonight I just want to kick back in front of TV."
  ],
  "knock down": [
    "potrącić (o samochodzie)",
    "She is in hospital after being knocked down by a car."
  ],
  "knock out": [
    "zwalać z nóg",
    "All these drinks yesterday just knocked me out.  His doctor gave him some tranquilizers that have knocked him down."
  ],
  "knuckle down": [
    "przysiąść nad czymś",
    "He usually does nothing all year round and knuckles down right before the exam."
  ],
  "land up": [
    "\"'wylądować'\"",
    "He landed up living in a cardbox under the bridge."
  ],
  "lavish on/upon": [
    "nie szczędzić, nie żałować",
    "His parents lavish a lot of money and attention on his education."
  ],
  "lay off": [
    "zwalniać",
    "Many people working in this factory were laid off without previous notice."
  ],
  "line up": [
    "ustawić w rzędzie",
    "She lined up her books on the shelf."
  ],
  "litter with": [
    "zasypać, zapełnić",
    "His inaugural speech was littered with cliches and empty rhetoric."
  ],
  "look down on sb": [
    "pogardzać, parzeć z góry",
    "She looks down on people of lower financial status than hers."
  ],
  "look for": [
    "szukać",
    "\"I'm looking for a room to rent. Do you know of any in this area?\""
  ],
  "loom ahead": [
    "\"'wisieć' nad kimś\"",
    "\"I can't fully relax with my exams looming ahead.\""
  ],
  "loom up": [
    "wyłaniać się, majaczyć",
    "\"The castle's gloomy silhouette loomed up in the horizon.\""
  ],
  "make out": [
    "zrozumieć, dostrzec, dosłyszeć",
    "I know this song but they sing so fast that I have never managed to make the words out."
  ],
  "make up for": [
    "nadrabiać, rekompensować",
    "She spends so much probably making up for the years when she was penniless."
  ],
  "match up": [
    "pasować, zgadzać się",
    "They will have to be interrogated once again as their stories proved not to match up."
  ],
  "melt down": [
    "topić",
    "Put some butter on the pan and wait till it melts down. Then add onion rings."
  ],
  "merge in": [
    "wtapiać się",
    "She watched him for a while but then he merged in the crowd."
  ],
  "mete out": [
    "wymierzać",
    "The court meted out such severe penalty that even the victim was stunned."
  ],
  "mess with": [
    "eksperymentować",
    "Do not mess with mixing alcohol."
  ],
  "mess with sb": [
    "zadzierać z kimś",
    "Do not mess with him! He is eager to solve problems with his fists."
  ],
  "mull over": [
    "myśleć, zastanawiać się",
    "I hate going shopping with her! She mulls over everything for hours and then buys nothing."
  ],
  "pass on": [
    "przekazać",
    "Have you passed on the message I sent you?"
  ],
  "pay back": [
    "oddać dług",
    "I will pay you back next week. Is that OK?"
  ],
  "pay sb back": [
    "odpłacić się, odegrać się",
    "\"I'm going to pay him back for all these stinging remarks.\""
  ],
  "pay off": [
    "spłacić",
    "I hope to pay this loan off before the deadline."
  ],
  "pick out": [
    "wybrać",
    "We spent hours looking for presents and finally picked out some books."
  ],
  "pin down": [
    "przycisnąć kogoś",
    "\"He didn't tell me much. We will need to pin him down to details.\""
  ],
  "piss off": [
    "wkurzać (slang)",
    "She was absolutely pissed off with his behaviour."
  ],
  "point out": [
    "wskazać, zwrócić uwagę",
    "She pointed out common writing mistakes her students should be aware of."
  ],
  "polish up": [
    "szlifować, odświeżyć",
    "His Spanish is not bad but he should polish it up a bit."
  ],
  "put down to": [
    "złożyć na karb czegoś",
    "She was unbearable yesterday but we put it down to the problems she has in her marriage."
  ],
  "ramble on": [
    "ględzić, rozwlekać",
    "I almost fell asleep when he started rambling on about his childhood."
  ],
  "reach out": [
    "sięgnąć po coś",
    "Could you reach out to press this button, please."
  ],
  "reduce to": [
    "sprowadzać, doprowadzać do",
    "Their accusations reduced her to tears."
  ],
  "refer to": [
    "wspominać, odnosić się do czegoś",
    "\"In his academic writning he always refers to Profesor Johnson's research.\""
  ],
  "rely on/upon": [
    "polegać na",
    "He relies on her common sense in situations like this one."
  ],
  "remind of": [
    "przypominać, kojarzyć",
    "She reminds me of a girl I knew years ago."
  ],
  "resort to": [
    "uciec się do czegoś",
    "To gain their goals they even resorted to violence."
  ],
  "result in": [
    "skutkować",
    "His negligence resulted in severe health problems."
  ],
  "rub out": [
    "wytrzeć",
    "You can write in pencil so if anybody wants to correct something just rub it out and write once again."
  ],
  "run down": [
    "\"'zjechać'\"",
    "The press will run the Congress down for passing this bill."
  ],
  "sail through": [
    "zrobić coś z łatwością",
    "She sailed through all the examinations.  We sailed through the passport control."
  ],
  "save up": [
    "zaoszczędzić",
    "I want to save up for a new computer."
  ],
  "scribble down": [
    "nabazgrać, bazgrać",
    "\"You can't scribble down like that - nobody can read it.\""
  ],
  "show off": [
    "popisywać się, przechwalać się",
    "What a jerk! All he can do is just showing off!"
  ],
  "slip away": [
    "wymknąć się",
    "\"Go for it! Don't let that opportunity slip away!\""
  ],
  "sort out": [
    "porządkować, rozwiązywać (problem)",
    "She needs to sort out things concerning their relationship."
  ],
  "splash out": [
    "\"'szarpnąć się', zaszaleć\"",
    "She needed some entertainment so decided to splash out in the city centre."
  ],
  "spread out": [
    "rozciągać się",
    "The forests spread out to the horizon."
  ],
  "stake on": [
    "stawiać na szali, ryzykować",
    "He staked his own reputation on and decided to support the strike."
  ],
  "stand up for": [
    "trwać przy swoich przekonaniach, zasadach",
    "You should always stand up for your beliefs."
  ],
  "stave off": [
    "zapobiec czemuś",
    "In this climate you should drink a lot of water to stave off dehydration."
  ],
  "stem from": [
    "wyrastać z czegoś, mieć początek",
    "His shyness stems from his low self-esteem."
  ],
  "stick to": [
    "trzymać się czegoś",
    "It looks yummy but I need to stick to my diet, you know..."
  ],
  "stock up": [
    "zaopatrzyć się",
    "I think we should stock up with beer - your friends are coming tonight..."
  ],
  "stoop to": [
    "zniżać się do czegoś",
    "\"I don't think Sally would stoop to sharing the details of their intimate life with tabloids.\""
  ],
  "take in": [
    "nabierać",
    "She was taken in by his lofty promises."
  ],
  "take to": [
    "polubić",
    "I took to her the moment I saw her smile."
  ],
  "tell apart": [
    "odróżnić",
    "They ceased fire as it was too dark to tell allies apart from enemies."
  ],
  "tell off": [
    "opierniczyć",
    "He told me off for not being ready with the project yet."
  ],
  "throw in": [
    "dorzucić coś gratis",
    "If you buy this coat, madam, we will throw the gloves in."
  ],
  "touch down": [
    "lądować",
    "The plane touched down safely and on time."
  ],
  "traffic in": [
    "szmuglować, rozprowadzać",
    "They were charged with trafficking in drugs."
  ],
  "trigger off": [
    "pociągać za sobą",
    "This street fight may trigger off more serious events."
  ],
  "turn in/into": [
    "zamienić się w, przeistoczyć się",
    "\"You wouldn't recognize her - she has turned into a dedicated women rights fighter.\""
  ],
  "wake up": [
    "obudzić się",
    "He woke up too late and had to leave without breakfast."
  ]
}